{"name":"Custom Holiday Utility","tagline":"Makes modded holidays behave","description":"Enable modded holidays in existing saves, and get rid of that pesky exception notification caused by uninstalling them.","version":"1.0","lastUpdated":"June 18, 2023","stage":"public","status":"untested","hideTranslations":true,"pages":[{"title":"For Users","html":"<div class=\"paragraphs\"><h2>What does this mod do?</h2><p>It fixes existing problems with modded holidays, which are explained in <a target=\"_blank\" href=\"https://www.patreon.com/posts/84572301\">this Patreon post</a>. Specifically, it:</p><ul><li>Makes it easy for modders to add custom holidays in a safe way</li><li>Allows custom holidays to appear in existing saves</li><p class=\"footnote\">Use the cheat <code>chu.add_missing_holidays</code> to add all newly installed holidays to a save</p><li>Fixes an error that occurs after uninstalling custom holidays</li><p class=\"footnote\"><span class=\"font-bold danger\">Important:</span> For this to work, this mod must be kept in your game even after uninstalling custom holidays. It works by detecting when the custom holiday is no longer installed. You can remove this mod after uninstalling the holiday, launching your game, and saving.</p></ul></div><div class=\"paragraphs\"><h2>Should I install this mod?</h2><p>If you are downloading a mod that lists this one as a requirement, then yes. If you want any modded holidays to appear in existing saves, or if you're uninstalling them and don't want to be harassed by an exception notification, then also yes.</p></div>"},{"title":"For Modders","html":"<h2>What can this mod do for me?</h2><p>This mod makes it easy for you to add custom holidays to the calendar without overriding the Seasons files (just write a snippet - no scripting required). It also allows your holidays to be added to existing saves, and that it does not cause exceptions when uninstalled.</p><h2>How can I use this mod?</h2><p>Go to the modder's documentation, which is just a sample snippet. If you've ever written tuning before, then you'll be able to figure it out. For a complete example, check out my <a target=\"_blank\" href=\"#/mods/extra-holidays\">Extra Holidays</a> mod.</p><hr><h2 class=\"danger\">Important notice</h2><p>Do not include my script in your own download, and do not re-upload it anywhere. Doing so will inevitably lead to users having the same code in their game multiple times, and it <span class=\"font-bold\">WILL</span> cause issues. Remember, this is not just an injector, but also a fix for an exception.</p>"},{"title":"Changelog","html":"<h2>1.0 (June 18, 2023)</h2><ul><li>Add snippet for injecting custom holidays.</li><li>Add command to retroactively add custom holidays to existing saves.</li><li>Remove uninstalled custom holidays from saves they're included in.</li></ul>"}],"requiredPacks":{"eps":["Seasons"]},"documentation":[{"host":"Google Drive","href":"https://drive.google.com/drive/folders/1xZTTfFxA18UMaW-MAu2z45eXo7pvQVrS?usp=sharing"}],"downloads":[{"host":"Sim File Share","href":"https://simfileshare.net/folder/191078/"},{"host":"Google Drive","href":"https://drive.google.com/drive/folders/1yY0cSKun1qGyzekXatcngoHhlnTt1Z2M?usp=sharing"}]}