{"name":"Show Sim Info","tagline":"View internal sim data","description":"View all of the internal data for particular sims with an interaction. Originally by Itasan on MTS.","version":"3.8.5","lastUpdated":"May 23, 2023","stage":"public","status":"working","hideTranslations":true,"pages":[{"title":"Details","html":"<h2>What does this mod do?</h2><div class=\"paragraphs\"><p>It allows you to view the internal data associated with your sims.</p><p>For screenshots and more in-depth details, please visit the <a href=\"https://modthesims.info/d/576053/show-search-sim-info-mod.html\" target=\"_blank\">original page by Itasan on MTS</a>.</p></div><h2>Why is this mod on this website?</h2><p>Show Sim Info broke after the July 26, 2022 patch for the High School Years pack, and its original creator, Itasan, no longer updates it. This is a very important mod for many modders and players, so I fixed it myself and wanted to share it with others.</p><h2>Known issues</h2><div class=\"paragraphs\"><ul><li>Familial relationships are not being filtered correctly</li><p class=\"footnote\">For instance, selecting \"spouse\" might show all household members</p></ul><p><span class=\"danger\">Please ensure you have deleted Ita's version of this mod (the one from Mod The Sims)</span>, and <a href=\"#/contact\">let me know</a> if you experience any issues with my version.</p></div><br><p class=\"text-subtle\"><span class=\"font-bold text-subtle\">To Itasan</span>: I assumed that you would be alright with someone else maintaining your mod because you have not been active in a couple of years. If this is not the case, please reach out to me and I will remove it from my website.</p>"},{"title":"Changelog","html":"<h2>3.8.5 (May 23, 2023)</h2><ul><li>Fix issue with displaying career history</li><p class=\"footnote\">This fixes a common issue with retired sims' career panels</p></ul><h2>3.8.4 (March 18, 2023)</h2><ul><li>Add compatibility with infants</li><li>Add compatibility for missing occult types (mermaid, werewolf, spellcaster, and plant sims)</li><li>Add compatibility for missing species (fox)</li></ul><h2>3.8.3 (August 7, 2022)</h2><ul><li>Fix issues with displaying age &amp; career data</li><li>Fix issues with using cheats</li><li>Fix issues with outputting to text file</li></ul><h2>3.8.2 (July 27, 2022)</h2><ul><li>Adopt this mod from <a href=\"https://modthesims.info/d/576053/show-search-sim-info-mod.html\" target=\"_blank\">Itasan</a></li><li>Fix issue from the High School Years patch (the \"This Sim\" interaction)</li></ul>"}],"downloadWarning":"If you have downloaded this mod from Mod The Sims, delete that version before installing this one. Note that using a cloud service (OneDrive, Google Drive, iCloud, etc.) to back up your Mods folder can cause files to stick around even after you think you've deleted them.","downloads":[{"host":"Sim File Share","href":"http://simfileshare.net/folder/167469/"},{"host":"Google Drive","href":"https://drive.google.com/drive/folders/1LysKnKrwf_dkunwtNRuBnDa81p0WeGX-?usp=sharing"}]}